getting data for gnuplot:  | <15> | <2> | <2> | <2> | <2> | <2> |   |   |
compare classifiers: | <10>  | <6> | <6> | <6> | <6> | <6> |   <5> |    <6> |  
compare versions:  | <15> | <5> | <5> |   <5> |   <5> |   <5> |   <5> |  <6> |
* table 2/3 +correct OR
  |            | ExtraTrees | RandomForest | KNeighbors | DecisionTree | SVC(scale) | overhead % |    max |
  | <10>       |    <6> |    <6> |    <6> |    <6> |    <6> |   <5> |    <6> |
  |------------+--------+--------+--------+--------+--------+-------+--------|
  | X-validation | 0.905374387382 | 0.875428431675 | 0.814423482934 | 0.881825562529 | 0.968168076394 |     0 | 96.816808 |
  | retro@30.js | 0.7675 |   0.74 | 0.703333333333 | 0.474166666667 | 0.123333333333 | 26.766882278 |  76.75 |
  | wfpad      | 0.760633861551 | 0.748123436197 | 0.674728940784 | 0.720600500417 | 0.29107589658 | 12.9047077098 | 76.063386 |
  | retro@50   | 0.741451209341 | 0.693077564637 | 0.676396997498 | 0.488740617181 | 0.264386989158 | 16.6027859811 | 74.145121 |
  | retro@70.js | 0.740833333333 |  0.705 | 0.6575 | 0.514166666667 |  0.315 | 22.3359945259 | 74.083333 |
  | simple1@10 | 0.734166666667 | 0.681666666667 | 0.664166666667 | 0.615833333333 | 0.164166666667 | 25.1641266803 | 73.416667 |
  | 22.0@10aI  | 0.7275 | 0.684166666667 | 0.679166666667 | 0.515833333333 | 0.103333333333 | 27.7337867893 |  72.75 |
  | tamaraw    | 0.7075 | 0.635833333333 | 0.6725 | 0.3175 | 0.415833333333 | 23.8743081642 |  70.75 |
  | simple2@30 | 0.209166666667 | 0.2025 | 0.191666666667 | 0.194166666667 | 0.141666666667 | 48.9719398629 | 20.916667 |
  | simple2@30burst | 0.236666666667 | 0.243333333333 | 0.195833333333 |  0.205 |  0.165 | 54.3315794585 | 24.333333 |
  | simple1@50 | 0.168333333333 | 0.169166666667 |   0.14 |   0.14 | 0.233333333333 | 70.893016648 | 23.333333 |
  #+TBLFM: $8=100*reduce(max, $2..$6)
* table 2/3 (bridge test-train-split)
  |            | ExtraTrees | RandomForest | KNeighbors | DecisionTree | SVC(scale) | overhead % |    max |
  | <10>       |    <6> |    <6> |    <6> |    <6> |    <6> |   <5> |    <6> |
  |------------+--------+--------+--------+--------+--------+-------+--------|
  | X-validation | 0.916470674736 | 0.893283053545 | 0.833026795719 | 0.888055842265 | 0.96954627519 |     0 | 96.954628 |
  | 0.15.3-re  | 0.746666666667 | 0.7275 | 0.6825 |  0.525 |  0.135 | 26.766882278 | 74.666667 |
  | 0.15.3-ret | 0.727272727273 | 0.695579649708 | 0.660550458716 | 0.525437864887 | 0.292743953294 | 16.6027859811 | 72.727273 |
  | wfpad      | 0.73894912427 | 0.715596330275 | 0.659716430359 | 0.723936613845 | 0.302752293578 | 12.9047077098 | 73.894912 |
  | 0.15.3-ret | 0.726666666667 | 0.6975 | 0.645833333333 | 0.539166666667 | 0.330833333333 | 22.3359945259 | 72.666667 |
  | 22.0@10aI  | 0.716666666667 | 0.6925 | 0.6675 | 0.533333333333 | 0.113333333333 | 27.7337867893 | 71.666667 |
  | simple1@10 |   0.71 | 0.686666666667 | 0.643333333333 | 0.636666666667 |  0.185 | 25.1641266803 |    71. |
  | simple1@50 | 0.165833333333 |  0.155 | 0.130833333333 | 0.1525 | 0.251666666667 | 70.893016648 | 25.166667 |
  | simple2@30 | 0.198333333333 |   0.18 | 0.184166666667 | 0.205833333333 | 0.124166666667 | 48.9719398629 | 20.583333 |
  #+TBLFM: $8=100*reduce(max, $2..$6)
* table bridge
  |            | ExtraTrees | RandomForest | KNeighbors | DecisionTree | SVC(scale) | overhead % |    max |
  | <10>       |    <6> |    <6> |    <6> |    <6> |    <6> |   <5> |    <6> |
  |------------+--------+--------+--------+--------+--------+-------+--------|
  | X-validation | 0.922804890859 | 0.900902479093 | 0.833026795719 | 0.894766375133 | 0.974214037703 |     0 | 97.421404 |
  | wfpad      | 0.785778577858 | 0.80198019802 | 0.701170117012 | 0.740774077408 | 0.390639063906 | 19.8453353207 | 80.198020 |
  | simple@10  | 0.798113207547 | 0.779245283019 | 0.721698113208 | 0.711320754717 | 0.183018867925 | 29.1931678384 | 79.811321 |
  | 22.0@10aI  | 0.771271729186 | 0.740164684355 | 0.718206770357 | 0.552607502287 | 0.112534309241 | 33.2183170937 | 77.127173 |
  | simple@50  | 0.17955801105 | 0.164825046041 | 0.142725598527 | 0.161141804788 | 0.266114180479 | 75.483688562 | 26.611418 |
  | simple2@30 | 0.2325 | 0.236666666667 | 0.203333333333 | 0.231666666667 | 0.154166666667 | 48.9719398629 | 23.666667 |
  #+TBLFM: $8=100*reduce(max, $2..$6)
* table addon
SVC(scale) |     % |    max |
  | <15>            |   <5> |   <5> |   <5> |   <5> |   <5> |   <5> |    <6> |
  |-----------------+-------+-------+-------+-------+-------+-------+--------|
  | 06-09@10        | 0.954136429608 | 0.954208998549 | 0.904644412192 | 0.927648766328 | 0.992307692308 |     0 | 99.230769 |
  | 06-17@10_from   | 0.965476190476 | 0.965476190476 | 0.924702380952 | 0.930853174603 | 0.9875 |     0 |  98.75 |
  | retro/30        | 0.831541218638 | 0.756272401434 | 0.824372759857 | 0.835125448029 | 0.967741935484 | 5.96205868901 | 96.774194 |
  | retro/10        | 0.855072463768 | 0.847826086957 | 0.844202898551 | 0.876811594203 | 0.95652173913 | 9.04459033622 | 95.652174 |
  | retro/1         | 0.886861313869 | 0.86496350365 | 0.861313868613 | 0.850364963504 | 0.952554744526 | 5.44125194462 | 95.255474 |
  | retro/0         | 0.875471698113 | 0.833962264151 | 0.864150943396 | 0.815094339623 | 0.939622641509 | 5.37331468639 | 93.962264 |
  | retro/20        | 0.85393258427 | 0.87265917603 | 0.831460674157 | 0.887640449438 | 0.898876404494 | 8.27004240349 | 89.887640 |
  | retro/5         | 0.889733840304 | 0.878326996198 | 0.87072243346 | 0.893536121673 | 0.863117870722 | 11.0126447664 | 89.353612 |
  | 0.18.2/b_i_from_100 | 0.612716763006 | 0.621387283237 | 0.638728323699 | 0.523121387283 | 0.647398843931 | 7.56895623136 | 64.739884 |
  | 0.15.3/nocache/40 | 0.285714285714 | 0.281853281853 | 0.277992277992 | 0.277992277992 | 0.540540540541 | 73.7504397967 | 54.054054 |
  | 0.15.3/nocache/5 | 0.300751879699 | 0.293233082707 | 0.281954887218 | 0.281954887218 | 0.533834586466 | 60.6319495048 | 53.383459 |
  | 0.15.3/nocache/10 | 0.324723247232 | 0.29520295203 | 0.287822878229 | 0.291512915129 | 0.531365313653 | 61.1153308588 | 53.136531 |
  | 0.15.3/nocache/30 | 0.287272727273 |  0.24 | 0.265454545455 | 0.294545454545 | 0.527272727273 | 70.4189527957 | 52.727273 |
  | 0.15.3/nocache/1 | 0.340740740741 | 0.325925925926 | 0.311111111111 | 0.322222222222 | 0.503703703704 | 59.3463452173 | 50.370370 |
  | 0.15.3/nocache/0 | 0.318681318681 | 0.289377289377 | 0.285714285714 | 0.289377289377 | 0.487179487179 | 63.2599134289 | 48.717949 |
  | 0.15.3/nocache/20 | 0.266666666667 | 0.262745098039 | 0.270588235294 | 0.262745098039 | 0.486274509804 | 62.465361493 | 48.627451 |
  | 0.15.3/nocache  |  0.28 | 0.283636363636 | 0.261818181818 | 0.265454545455 |  0.44 | 76.0609416381 |    44. |
  | 0.15.3/cache    | 0.262773722628 | 0.259124087591 | 0.251824817518 | 0.273722627737 | 0.430656934307 | 85.7112448946 | 43.065693 |
  | 0.21.0_ai       | 0.346456692913 | 0.354330708661 | 0.362204724409 | 0.374015748031 | 0.133858267717 | 116.869091043 | 37.401575 |
  | 20.0/20_ai      | 0.153256704981 | 0.153256704981 | 0.149425287356 | 0.153256704981 | 0.35632183908 | 198.062095036 | 35.632184 |
  | 0.18.2/a_i_noburst/ | 0.229571984436 | 0.225680933852 | 0.225680933852 | 0.233463035019 | 0.307392996109 | 152.595901679 | 30.739300 |
  | 0.18.2/a_ii_noburst | 0.195402298851 | 0.195402298851 | 0.195402298851 | 0.183908045977 | 0.252873563218 | 146.44928088 | 25.287356 |
  | 0.19/20_bi      | 0.181818181818 | 0.177865612648 | 0.177865612648 | 0.197628458498 | 0.114624505929 | 238.256936475 | 19.762846 |
  | 20.0/0_bi       | 0.0804597701149 | 0.0919540229885 | 0.0919540229885 | 0.088122605364 | 0.195402298851 | 218.240773017 | 19.540230 |
  | 0.19/0_aii      | 0.18431372549 | 0.176470588235 | 0.192156862745 | 0.18431372549 | 0.0901960784314 | 246.081082364 | 19.215686 |
  | 20.0/40_ai      | 0.139622641509 | 0.143396226415 | 0.147169811321 | 0.135849056604 | 0.192452830189 | 239.426094305 | 19.245283 |
  | 0.19/0_bii      | 0.187755102041 | 0.187755102041 | 0.191836734694 | 0.191836734694 | 0.187755102041 | 194.720098923 | 19.183673 |
  | 20.0/20_bi      | 0.18992248062 | 0.18992248062 | 0.186046511628 | 0.18992248062 | 0.112403100775 | 229.632542003 | 18.992248 |
  | 20.0/0_ai       | 0.166007905138 | 0.162055335968 | 0.173913043478 | 0.177865612648 | 0.185770750988 | 210.566496147 | 18.577075 |
  | 20.0/40_bii     | 0.129032258065 | 0.133064516129 | 0.133064516129 | 0.137096774194 | 0.181451612903 | 231.261406395 | 18.145161 |
  | 0.19/20_bii     | 0.171548117155 | 0.167364016736 | 0.179916317992 | 0.167364016736 | 0.154811715481 | 217.548934833 | 17.991632 |
  | 20.0/40_aii     | 0.158671586716 | 0.162361623616 | 0.158671586716 | 0.158671586716 | 0.169741697417 | 244.15757123 | 16.974170 |
  | 20.0/0_aii      | 0.135658914729 | 0.143410852713 | 0.135658914729 | 0.124031007752 | 0.162790697674 | 217.947386813%) | 16.279070 |
  | 0.19/0_ai       | 0.129770992366 | 0.125954198473 | 0.13358778626 | 0.129770992366 | 0.148854961832 | 210.138737341 | 14.885496 |
  | 20.0/20_aii     | 0.147859922179 | 0.155642023346 | 0.155642023346 | 0.15953307393 | 0.143968871595 | 230.464242106 | 15.953307 |
  | 20.0/20_bii     | 0.150406504065 | 0.150406504065 | 0.154471544715 | 0.154471544715 | 0.121951219512 | 239.755825512 | 15.447154 |
  | 20.0/40_bi      | 0.14552238806 | 0.141791044776 | 0.141791044776 | 0.138059701493 | 0.130597014925 | 232.698559034 | 14.552239 |
  | 20.0/0_bii      | 0.14552238806 | 0.141791044776 | 0.14552238806 | 0.141791044776 | 0.108208955224 | 268.903927294 | 14.552239 |
  #+TBLFM: $8=100*reduce(max, $2..$6)
* table wfpad
  |            | ExtraTrees | RandomForest | KNeighbors | DecisionTree | SVC(scale) | %     |     max |
  |            |    <6> |    <6> |    <6> |    <6> |    <6> | <5>   |     <7> |
  |------------+--------+--------+--------+--------+--------+-------+---------|
  | x-validate | 0.860064935065 | 0.895909090909 | 0.88525974026 | 0.91025974026 | 0.946103896104 |       | 94.610390 |
  | enabled    |  0.875 | 0.908088235294 | 0.886029411765 | 0.922794117647 | 0.9375 | 0.220331273228 |   93.75 |
  #+TBLFM: $8=100*reduce(max, $2..$6)
* table addon@100
  |                 | ExtraTrees | RandomForest | KNeighbors | DecisionTree | SVC(scale) |     % |    max |
  | <15>            |   <5> |   <5> |   <5> |   <5> |   <5> |   <5> |    <6> |
  |-----------------+-------+-------+-------+-------+-------+-------+--------|
  | x-validate      | 0.857974370143 | 0.820121042617 | 0.772865515845 | 0.787230538808 | 0.915999556788 |     0 | 91.599956 |
  | 0.18.2/b_i_noburst | 0.195513708114 | 0.181944059817 | 0.198836887289 | 0.12628080864 | 0.111326502354 | 24.2101478249 | 19.883689 |
  #+TBLFM: $8=100*reduce(max, $2..$6)

